#include<stdio.h>
#include<string.h>
struct lbj{
	char name[50];
	char time[50];
	float price;
	char no[50];
}t,a[5]={{"机身","1年",60000000,"001"},
		{"机翼","3年",20000000,"002"},
		{"发动机","5年",80000000,"003"},
		{"动力装置","7年",40000000,"004"},
		{"起落架","9年",10000000,"005"}};
int main(){
	void  f1(lbj a[5]);
	void  f2(lbj a[5]);
	void  f3(lbj a[5]);
	f1(a);
	f2(a);
	f3(a);
return 0;
}
void f1(lbj a[5]){
	int i;
	printf("显示所有零部件信息\n");
	printf("------------------------------------------------------\n");
	printf("|零部件名称    |出场时间    |价格           |编号    |\n");
	for(i=0;i<5;i++){
		printf("|--------------|------------|---------------|--------|\n");
		printf("|%-14s|",a[i].name);
		printf("%-12s|",a[i].time);
		printf("%-15.2f|",a[i].price);
		printf("%-8s|\n",a[i].no);
	}
	printf("------------------------------------------------------\n\n");
}
void f2(lbj a[5]){
	int i,j;
	for(i=0;i<5;i++)
		for(j=0;j<5-i;j++)
			if(a[j].price<a[j+1].price){
				t=a[j];
				a[j]=a[j+1];
				a[j+1]=t;
			}
	printf("将零部件的信息按价格进行排序\n");
	printf("------------------------------------------------------\n");
	printf("|零部件名称    |出场时间    |价格           |编号    |\n");
	for(i=0;i<5;i++){
		printf("|--------------|------------|---------------|--------|\n");
		printf("|%-14s|",a[i].name);
		printf("%-12s|",a[i].time);
		printf("%-15.2f|",a[i].price);
		printf("%-8s|\n",a[i].no);
	}
	printf("------------------------------------------------------\n\n");
	printf("价格最高的零部件信息为\n");
	printf("------------------------------------------------------\n");
	printf("|零部件名称    |出场时间    |价格           |编号    |\n");
	printf("|--------------|------------|---------------|--------|\n");
		printf("|%-14s|",a[0].name);
		printf("%-12s|",a[0].time);
		printf("%-15.2f|",a[0].price);
		printf("%-8s|\n",a[0].no);
		printf("------------------------------------------------------\n\n");
		printf("价格最低的零部件信息为\n");
	printf("------------------------------------------------------\n");
	printf("|零部件名称    |出场时间    |价格           |编号    |\n");
	printf("|--------------|------------|---------------|--------|\n");
		printf("|%-14s|",a[4].name);
		printf("%-12s|",a[4].time);
		printf("%-15.2f|",a[4].price);
		printf("%-8s|\n",a[4].no);
		printf("------------------------------------------------------\n\n");
}
void f3(lbj a[5]){
	int i;
	printf("显示出场时间大于5年的零部件\n");
	printf("------------------------------------------------------\n");
	printf("|零部件名称    |出场时间    |价格           |编号    |\n");
	for(i=0;i<5;i++)
		if(strcmp(a[i].time,"5年")==1){
			printf("|--------------|------------|---------------|--------|\n");
			printf("|%-14s|",a[i].name);
			printf("%-12s|",a[i].time);
			printf("%-15.2f|",a[i].price);
			printf("%-8s|\n",a[i].no);
		}
	printf("------------------------------------------------------\n\n");
	printf("将出场时间大于5年的零部件的价格改为原价格的一半\n");
	printf("------------------------------------------------------\n");
	printf("|零部件名称    |出场时间    |价格           |编号    |\n");
	for(i=0;i<5;i++)
		if(strcmp(a[i].time,"5年")==1){
			a[i].price/=2;
			printf("|--------------|------------|---------------|--------|\n");
			printf("|%-14s|",a[i].name);
			printf("%-12s|",a[i].time);
			printf("%-15.2f|",a[i].price);
			printf("%-8s|\n",a[i].no);
		}
	printf("------------------------------------------------------\n\n");
}